<?php
// +----------------------------------------------------------------------
// | RXThinkCMF框架 [ RXThinkCMF ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2020 南京RXThinkCMF研发中心
// +----------------------------------------------------------------------
// | 官方网站: http://www.rxthink.cn
// +----------------------------------------------------------------------
// | Author: 牧羊人 <1175401194@qq.com>
// +----------------------------------------------------------------------

namespace app\admin\event;

use app\admin\model\ActionLog;

/**
 * 登录事件
 *
 * @author 牧羊人
 * @since 2020-04-21
 */
class AdminLog
{

    /**
     * 登录时间执行句柄
     *
     * @author 牧羊人
     * @since 2020-04-21
     */
    public function handle()
    {
        if (request()->isPost()) {
            ActionLog::record();
        }
    }
}