<!doctype html>
<html>
<head>
<meta charset="UTF-8" />
<title><?php echo $Title; ?> - <?php echo $Powered; ?></title>
<link rel="stylesheet" href="./css/install.css?v=9.0" />
</head>
<body>
<div class="wrap">
  <?php require './templates/header.php';?>
  <div class="section">
    <div class="main cc">
      <pre class="pact" readonly="readonly">
          <h1 style="text-align: center;">软件许可协议</h1>

提示条款：
本协议是您与【RXThinkCMF研发工作室】共同签署。
<strong>RXThinkCMF后台开发框架（以下称“RXThinkCMF”），由RXThinkCMF研发工作室打造的一款中高端产品，版权所有Copyright © 2017~2020 www.rxthink.cn. All rights reserved.，RXThinkCMF研发工作室保留所有权利。RXThinkCMF是国内最稳定、最强大、最先进的数据中台解决方案之一，RXThinkCMF基于 PHP + MySQL 的技术，采用ThinkPHP框架开发。RXThinkCMF官方对此拥有最终修改权和解释权。</strong>
RXThinkCMF官方网站：http://www.rxthink.cn
<strong>在使用RXThinkCMF开发框架（以下称“许可软件”或“本软件”）之前，请您仔细阅读本协议，特别是法律适用和争议解决条款，此等条款将以粗体标识，您需要重点阅读。如您对协议有任何疑问，可向客服咨询。如果您已下载、复制、安装或以其他任何方式使用该软件，则视为已经接受本协议。如果您不接受本协议的全部或部分条款，您将无权使用本软件。请立即终止安装、或以其他方式使用该软件，删除您已经安装或保留的该软件的任何组件。</strong>
由于互联网高速发展，您与我们签署的本协议列明的条款并不能完整罗列并覆盖您与我们所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。
因此，《版权声明》及其他规则均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用许可软件，视为您同意上述补充协议。我们如修改本协议或其补充协议，协议条款修改后，请您仔细阅读并接受修改后的协议后再继续使用许可软件。
<br/>
一、定义
软件（许可软件或本软件）：本协议中的“软件”是指RXThinkCMF开发框架，由若干模块或功能组件组成的已经植入或即将植入指定产品内的信息处理程序或支持文件，其中支持文件具体包括软件的源代码、目标码以及相关软件中所包含的图片、照片、图标、动画、录音、录像、音乐、文字、代码的全部或部分，还包括与许可软件或本工作室产品相关的所有描述其功能、特点、内容、质量、测试、用户手册、用户许可协议等纸质或电子版的资料、技术文档等。
您：本协议中的“您”是指取得RXThinkCMF研发工作室合法许可使用本软件权利的个人或单个法人实体，法人实体包括公司、企业、机构、组织或单位。
我们：本协议中的“我们”即是RXThinkCMF官方，是指RXThinkCMF研发工作室。
二次开发：本协议中的“二次开发”在现有的软件上进行定制修改，如对功能扩展，达到您想要的功能，原则不得改变本软件原有系统内核及系统设定的框架，我们允许的二次开发仅指对部分软件界面、功能删改或扩展，并非对内核及框架进行实质性修改。
<br/>
二、软件许可使用内容
在您遵守本协议内容的前提下，您通过我们指定合法渠道购买软件商用许可后，RXThinkCMF研发工作室授予您的商用许可权利包括：
1、安装和使用权利：您可以为商用目的安装和使用本软件，使用本软件提供的全部功能。
2、绑定唯一域名的权利：在安装本软件前，您应当自备一个域名并告知我们，以便我们将域名与本软件进行绑定。该绑定域名是商用许可软件的唯一指向。您应确保域名的唯一性、有效性，域名一经绑定，不得随意更换。您自备的域名可以是顶级、二级、或三级域名，您应对域名合法性、有效性承担责任。在使用本软件过程中，如需更换域名，应提前三个工作日以书面方式告知我们并如实告知被更换域名存在的问题，否则，我们有权利不予更换。
3、申请商用授权码的权利：您在我们指定合法渠道购买软件商用许可后，凭借订单号可以在我们官网申请商用授权码，并通过我们官方网站下载授权证书。
4、获取商用授权证书的权利：通过我们官方网站下载的商用授权证书是许可您将软件商用的合法凭证。该授权证书是授予您以本协议约定方式合法使用软件的永久授权，但我们不对授权作无限制使用的永久承诺。
5、授权内容使用权：在取得我们许可后，您拥有使用本软件构建的网站全部内容使用权，并独立承担与之相关法律义务。您可以在协议规定的约束条件下和限制范围内修改 RXThinkCMF 源代码或界面风格以适应您的网站要求，但应保留我们的版权信息。不管你的网站是否整体使用 RXThinkCMF ，还是部份栏目使用 RXThinkCMF，在你使用了 RXThinkCMF 的网站主页上必须加上 RXThinkCMF 官方网址(www.rxthink.cn)的链接。
6、在获得商业授权之后，您才可以将本软件应用于商业用途，同时依据所购买的授权类型确定技术支持内容。商业授权用户享有反馈意见和提出建议的权力，相关意见和建议将在我们下一次软件升级中被优先考虑，但我们对此不作承诺或保证。
7、本软件适用运营环境，在软件相关文档中已经明确提示，如因软件安装不符运营环境造成的故障，我们不承担任何责任。
<br/>
三、保密条款
双方都应为可能获知另一方的商业计划、客户方资料、技术、产品、代码、文档和其他作为该方商业秘密的秘密信息予以保密。秘密信息包括所有有形的或无形的、标明为秘密的信息。秘密信息归披露方所有，除非经披露方声明许可否则不得披露或使用。
<br/>
四、其他
1、本协议未约定的，由双方另行商定。
2、本协议的所有标题仅是为了醒目及阅读方便，本身并没有实际涵义，不能作为解释本协议涵义的依据。（正文完）

RXThinkCMF研发工作室 宣
</pre>
    </div>
    <div class="bottom tac"> <a href="<?php echo $_SERVER['PHP_SELF']; ?>?step=2" class="btn">接 受</a> </div>
  </div>
</div>
<?php require './templates/footer.php';?>
</body>
</html>